
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        6 |           2 |          0 |
## Affected resources by action

|  Action  | Resources                                                                               |
|:--------:|:----------------------------------------------------------------------------------------|
|    🟢    | `module.org_governance_tester.aws_iam_policy.pytest-permissions`                        |
|    🟢    | `module.org_governance_tester.aws_iam_policy.role-permissions`                          |
|    🟢    | `module.org_governance_tester.aws_iam_role.role-tester`                                 |
|    🟢    | `module.org_governance_tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢    | `module.org_governance_tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢    | `module.org_governance_tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
|    🟡    | `module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost`                           |
|    🟡    | `module.cost-alert.aws_sns_topic.cost_notifications`                                    |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "periodic_cost" {
        id                                    = "[infrahouse]: AWS daily cost"
      ~ tags                                  = {
          + "created_by_module" = "infrahouse/cost-alert/aws"
          + "environment"       = "production"
          + "module_version"    = "1.1.1"
        }
      ~ tags_all                              = {
          + "created_by_module" = "infrahouse/cost-alert/aws"
          + "module_version"    = "1.1.1"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cost-alert.aws_sns_topic.cost_notifications will be updated in-place
  ~ resource "aws_sns_topic" "cost_notifications" {
        id                                       = "arn:aws:sns:us-east-1:990466748045:cost-periodic-20241029191106708600000002"
      + kms_master_key_id                        = "alias/aws/sns"
        name                                     = "cost-periodic-20241029191106708600000002"
      ~ tags                                     = {
          + "created_by_module" = "infrahouse/cost-alert/aws"
          + "environment"       = "production"
        }
      ~ tags_all                                 = {
          + "created_by_module" = "infrahouse/cost-alert/aws"
            # (2 unchanged elements hidden)
        }
        # (29 unchanged attributes hidden)
    }

  # module.org_governance_tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "pytest-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
    }

  # module.org_governance_tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "org-governance-tester-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
    }

  # module.org_governance_tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_16bdbe5eb442e7ef"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::990466748045:role/org-governance-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-org-governance:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-org-governance"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "org-governance-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control"
          + "environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.org_governance_tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "org-governance-tester"
    }

  # module.org_governance_tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "org-governance-tester"
    }

  # module.org_governance_tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "org-governance-tester"
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/backup/outputs.tf line 8, in output "aws_region":
   8:   value       = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYsICJjaGFuZ2UiOiAyLCAiZGVzdHJveSI6IDB9fQ==
```
</details>